## Solutions

You will need:
- Chapter 1 (SQL Cook Book). In this notebook you will be practicing the code provided in the chapter.
- Download emp.csv and dept.csv
    - [emp.csv](_static/emp.csv)
    - [dept.csv](_static/dept.csv)

************
- Step 1-4: You will create a database week1.db
- Step 5: Practice Chapter 1 code
- Step 6: Close db connection
- Step 7: Open db connection using week1.db (you do not need step1-4 anymore)

In [1]:
import sqlite3
import pandas as pd

STEP 1. Create a database named week1. You shsold have a new file week1.db in your local directory.

In [2]:
conn = sqlite3.connect('week1.db')  
c = conn.cursor()

STEP 2. Read emp.csv and create a table emp

In [3]:
read_emp = pd.read_csv(r'emp.csv')
read_emp.to_sql('emp', conn, if_exists='append', index = False) # Insert the values from the csv file into the table 'emp'

STEP 3. read dept.csv and create a table dept

In [4]:
read_dept = pd.read_csv(r'dept.csv')
read_dept.to_sql('dept', conn, if_exists='append', index = False) # Insert the values from the csv file into the table 'dept'

Execution Examples

SQL statements will be executed with 

c.execute('''
SQL code
''')

In [5]:
#Example 1
for row in c.execute('''
select * from emp
'''):
    print(row)

(7369, 'SMITH', 'CLERK', 7902.0, '17-Dec-05', 800, None, 20)
(7499, 'ALLEN', 'SALESMAN', 7698.0, '20-Feb-06', 1600, 300.0, 30)
(7521, 'WARD', 'SALESMAN', 7698.0, '22-Feb-06', 1250, 500.0, 30)
(7566, 'JONES', 'MANAGER', 7839.0, '2-Apr-06', 2975, None, 20)
(7654, 'MARTIN', 'SALESMAN', 7698.0, '28-Sep-06', 1250, 1400.0, 30)
(7698, 'BLAKE', 'MANAGER', 7839.0, '1-May-06', 2850, None, 30)
(7782, 'CLARK', 'MANAGER', 7839.0, '9-Jun-06', 2450, None, 10)
(7788, 'SCOTT', 'ANALYST', 7566.0, '9-Dec-07', 3000, None, 20)
(7839, 'KING', 'PRESIDENT', None, '17-Nov-06', 5000, None, 10)
(7844, 'TURNER', 'SALESMAN', 7698.0, '8-Sep-06', 1500, 0.0, 30)
(7876, 'ADAMS', 'CLERK', 7788.0, '12-Jan-08', 1100, None, 20)
(7900, 'JAMES', 'CLERK', 7698.0, '3-Dec-06', 950, None, 30)
(7902, 'FORD', 'ANALYST', 7566.0, '3-Dec-06', 3000, None, 20)
(7934, 'MILLER', 'CLERK', 7782.0, '23-Jan-07', 1300, None, 10)
(7369, 'SMITH', 'CLERK', 7902.0, '17-Dec-05', 800, None, 20)
(7499, 'ALLEN', 'SALESMAN', 7698.0, '20-Feb-06', 1600, 300.0, 30)
(7521, 'WARD', 'SALESMAN', 7698.0, '22-Feb-06', 1250, 500.0, 30)
(7566, 'JONES', 'MANAGER', 7839.0, '2-Apr-06', 2975, None, 20)
(7654, 'MARTIN', 'SALESMAN', 7698.0, '28-Sep-06', 1250, 1400.0, 30)
(7698, 'BLAKE', 'MANAGER', 7839.0, '1-May-06', 2850, None, 30)
(7782, 'CLARK', 'MANAGER', 7839.0, '9-Jun-06', 2450, None, 10)
(7788, 'SCOTT', 'ANALYST', 7566.0, '9-Dec-07', 3000, None, 20)
(7839, 'KING', 'PRESIDENT', None, '17-Nov-06', 5000, None, 10)
(7844, 'TURNER', 'SALESMAN', 7698.0, '8-Sep-06', 1500, 0.0, 30)
(7876, 'ADAMS', 'CLERK', 7788.0, '12-Jan-08', 1100, None, 20)
(7900, 'JAMES', 'CLERK', 7698.0, '3-Dec-06', 950, None, 30)
(7902, 'FORD', 'ANALYST', 7566.0, '3-Dec-06', 3000, None, 20)
(7934, 'MILLER', 'CLERK', 7782.0, '23-Jan-07', 1300, None, 10)
(7369, 'SMITH', 'CLERK', 7902.0, '17-Dec-05', 800, None, 20)
(7499, 'ALLEN', 'SALESMAN', 7698.0, '20-Feb-06', 1600, 300.0, 30)
(7521, 'WARD', 'SALESMAN', 7698.0, '22-Feb-06', 1250, 500.0, 30)
(7566, 'JONES', 'MANAGER', 7839.0, '2-Apr-06', 2975, None, 20)
(7654, 'MARTIN', 'SALESMAN', 7698.0, '28-Sep-06', 1250, 1400.0, 30)
(7698, 'BLAKE', 'MANAGER', 7839.0, '1-May-06', 2850, None, 30)
(7782, 'CLARK', 'MANAGER', 7839.0, '9-Jun-06', 2450, None, 10)
(7788, 'SCOTT', 'ANALYST', 7566.0, '9-Dec-07', 3000, None, 20)
(7839, 'KING', 'PRESIDENT', None, '17-Nov-06', 5000, None, 10)
(7844, 'TURNER', 'SALESMAN', 7698.0, '8-Sep-06', 1500, 0.0, 30)
(7876, 'ADAMS', 'CLERK', 7788.0, '12-Jan-08', 1100, None, 20)
(7900, 'JAMES', 'CLERK', 7698.0, '3-Dec-06', 950, None, 30)
(7902, 'FORD', 'ANALYST', 7566.0, '3-Dec-06', 3000, None, 20)
(7934, 'MILLER', 'CLERK', 7782.0, '23-Jan-07', 1300, None, 10)
(7369, 'SMITH', 'CLERK', 7902.0, '17-Dec-05', 800, None, 20)
(7499, 'ALLEN', 'SALESMAN', 7698.0, '20-Feb-06', 1600, 300.0, 30)
(7521, 'WARD', 'SALESMAN', 7698.0, '22-Feb-06', 1250, 500.0, 30)
(7566, 'JONES', 'MANAGER', 7839.0, '2-Apr-06', 2975, None, 20)
(7654, 'MARTIN', 'SALESMAN', 7698.0, '28-Sep-06', 1250, 1400.0, 30)
(7698, 'BLAKE', 'MANAGER', 7839.0, '1-May-06', 2850, None, 30)
(7782, 'CLARK', 'MANAGER', 7839.0, '9-Jun-06', 2450, None, 10)
(7788, 'SCOTT', 'ANALYST', 7566.0, '9-Dec-07', 3000, None, 20)
(7839, 'KING', 'PRESIDENT', None, '17-Nov-06', 5000, None, 10)
(7844, 'TURNER', 'SALESMAN', 7698.0, '8-Sep-06', 1500, 0.0, 30)
(7876, 'ADAMS', 'CLERK', 7788.0, '12-Jan-08', 1100, None, 20)
(7900, 'JAMES', 'CLERK', 7698.0, '3-Dec-06', 950, None, 30)
(7902, 'FORD', 'ANALYST', 7566.0, '3-Dec-06', 3000, None, 20)
(7934, 'MILLER', 'CLERK', 7782.0, '23-Jan-07', 1300, None, 10)
(7369, 'SMITH', 'CLERK', 7902.0, '17-Dec-05', 800, None, 20)
(7499, 'ALLEN', 'SALESMAN', 7698.0, '20-Feb-06', 1600, 300.0, 30)
(7521, 'WARD', 'SALESMAN', 7698.0, '22-Feb-06', 1250, 500.0, 30)
(7566, 'JONES', 'MANAGER', 7839.0, '2-Apr-06', 2975, None, 20)
(7654, 'MARTIN', 'SALESMAN', 7698.0, '28-Sep-06', 1250, 1400.0, 30)
(7698, 'BLAKE', 'MANAGER', 7839.0, '1-May-06', 2850, None, 30)
(7782, 'CLARK', 'MANAGER', 7839.0, '9-Jun-06', 2450, None, 10)
(7788, 'SCOTT', 'ANALYST', 7566.0, '9-Dec-07', 3000, None, 20)
(7839, 'KING', 'PRESIDENT', None, '17-Nov-06', 5000, None, 10)
(7844, 'TURNER', 'SALESMAN', 7698.0, '8-Sep-06', 1500, 0.0, 30)
(7876, 'ADAMS', 'CLERK', 7788.0, '12-Jan-08', 1100, None, 20)
(7900, 'JAMES', 'CLERK', 7698.0, '3-Dec-06', 950, None, 30)
(7902, 'FORD', 'ANALYST', 7566.0, '3-Dec-06', 3000, None, 20)
(7934, 'MILLER', 'CLERK', 7782.0, '23-Jan-07', 1300, None, 10)

In [6]:
colnames = c.description
for row in colnames:
    print(row[0])

EMPNO
ENAME
JOB
MGR
HIREDATE
SAL
COMM
DEPTNO

To print a table, use fetchall() to collect data and add column names thaht you have selected.

In [7]:
# Example 2
c.execute('''
select * from emp
''')

df = pd.DataFrame(c.fetchall(), columns=['EMPNO',
'ENAME',
'JOB',
'MGR',
'HIREDATE',
'SAL',
'COMM',
'DEPTNO'])
print(df)

    EMPNO   ENAME       JOB     MGR   HIREDATE   SAL    COMM  DEPTNO
0    7369   SMITH     CLERK  7902.0  17-Dec-05   800     NaN      20
1    7499   ALLEN  SALESMAN  7698.0  20-Feb-06  1600   300.0      30
2    7521    WARD  SALESMAN  7698.0  22-Feb-06  1250   500.0      30
3    7566   JONES   MANAGER  7839.0   2-Apr-06  2975     NaN      20
4    7654  MARTIN  SALESMAN  7698.0  28-Sep-06  1250  1400.0      30
..    ...     ...       ...     ...        ...   ...     ...     ...
65   7844  TURNER  SALESMAN  7698.0   8-Sep-06  1500     0.0      30
66   7876   ADAMS     CLERK  7788.0  12-Jan-08  1100     NaN      20
67   7900   JAMES     CLERK  7698.0   3-Dec-06   950     NaN      30
68   7902    FORD   ANALYST  7566.0   3-Dec-06  3000     NaN      20
69   7934  MILLER     CLERK  7782.0  23-Jan-07  1300     NaN      10

[70 rows x 8 columns]

### Basics of SQL Queries  

**SELECT**: Statement used to select rows and columns from a database. 

**FROM**:  Specifies which table in the database you want to direct your query to.

**WHERE**: Clause for filtering for specified value(s).

**GROUP BY**: Aggregating data. Needs to be used in conjunction with SQL aggregating functions like `SUM` and `COUNT`.

**ORDER BY**: Sorting columns in the database. 

**JOIN**: Joins are used to combine tables with one another. 

**UNION**, **INTERSECT/EXCEPT**: Set operations. Unioning in SQL allows one to append tables on top of one another.

### Step 5. Practice Chapter 1

In [8]:
## Your turn

### Step 6. Close the connection

In [9]:
conn.close()

### Step 7. Open connection with your database week1.db

In [10]:
conn = sqlite3.connect('week1.db')
c = conn.cursor()

In [11]:
## You can continue working with SQL coding now

In [12]:
for row in c.execute('''select * from emp'''):
    print(row)

(7369, 'SMITH', 'CLERK', 7902.0, '17-Dec-05', 800, None, 20)
(7499, 'ALLEN', 'SALESMAN', 7698.0, '20-Feb-06', 1600, 300.0, 30)
(7521, 'WARD', 'SALESMAN', 7698.0, '22-Feb-06', 1250, 500.0, 30)
(7566, 'JONES', 'MANAGER', 7839.0, '2-Apr-06', 2975, None, 20)
(7654, 'MARTIN', 'SALESMAN', 7698.0, '28-Sep-06', 1250, 1400.0, 30)
(7698, 'BLAKE', 'MANAGER', 7839.0, '1-May-06', 2850, None, 30)
(7782, 'CLARK', 'MANAGER', 7839.0, '9-Jun-06', 2450, None, 10)
(7788, 'SCOTT', 'ANALYST', 7566.0, '9-Dec-07', 3000, None, 20)
(7839, 'KING', 'PRESIDENT', None, '17-Nov-06', 5000, None, 10)
(7844, 'TURNER', 'SALESMAN', 7698.0, '8-Sep-06', 1500, 0.0, 30)
(7876, 'ADAMS', 'CLERK', 7788.0, '12-Jan-08', 1100, None, 20)
(7900, 'JAMES', 'CLERK', 7698.0, '3-Dec-06', 950, None, 30)
(7902, 'FORD', 'ANALYST', 7566.0, '3-Dec-06', 3000, None, 20)
(7934, 'MILLER', 'CLERK', 7782.0, '23-Jan-07', 1300, None, 10)
(7369, 'SMITH', 'CLERK', 7902.0, '17-Dec-05', 800, None, 20)
(7499, 'ALLEN', 'SALESMAN', 7698.0, '20-Feb-06', 1600, 300.0, 30)
(7521, 'WARD', 'SALESMAN', 7698.0, '22-Feb-06', 1250, 500.0, 30)
(7566, 'JONES', 'MANAGER', 7839.0, '2-Apr-06', 2975, None, 20)
(7654, 'MARTIN', 'SALESMAN', 7698.0, '28-Sep-06', 1250, 1400.0, 30)
(7698, 'BLAKE', 'MANAGER', 7839.0, '1-May-06', 2850, None, 30)
(7782, 'CLARK', 'MANAGER', 7839.0, '9-Jun-06', 2450, None, 10)
(7788, 'SCOTT', 'ANALYST', 7566.0, '9-Dec-07', 3000, None, 20)
(7839, 'KING', 'PRESIDENT', None, '17-Nov-06', 5000, None, 10)
(7844, 'TURNER', 'SALESMAN', 7698.0, '8-Sep-06', 1500, 0.0, 30)
(7876, 'ADAMS', 'CLERK', 7788.0, '12-Jan-08', 1100, None, 20)
(7900, 'JAMES', 'CLERK', 7698.0, '3-Dec-06', 950, None, 30)
(7902, 'FORD', 'ANALYST', 7566.0, '3-Dec-06', 3000, None, 20)
(7934, 'MILLER', 'CLERK', 7782.0, '23-Jan-07', 1300, None, 10)
(7369, 'SMITH', 'CLERK', 7902.0, '17-Dec-05', 800, None, 20)
(7499, 'ALLEN', 'SALESMAN', 7698.0, '20-Feb-06', 1600, 300.0, 30)
(7521, 'WARD', 'SALESMAN', 7698.0, '22-Feb-06', 1250, 500.0, 30)
(7566, 'JONES', 'MANAGER', 7839.0, '2-Apr-06', 2975, None, 20)
(7654, 'MARTIN', 'SALESMAN', 7698.0, '28-Sep-06', 1250, 1400.0, 30)
(7698, 'BLAKE', 'MANAGER', 7839.0, '1-May-06', 2850, None, 30)
(7782, 'CLARK', 'MANAGER', 7839.0, '9-Jun-06', 2450, None, 10)
(7788, 'SCOTT', 'ANALYST', 7566.0, '9-Dec-07', 3000, None, 20)
(7839, 'KING', 'PRESIDENT', None, '17-Nov-06', 5000, None, 10)
(7844, 'TURNER', 'SALESMAN', 7698.0, '8-Sep-06', 1500, 0.0, 30)
(7876, 'ADAMS', 'CLERK', 7788.0, '12-Jan-08', 1100, None, 20)
(7900, 'JAMES', 'CLERK', 7698.0, '3-Dec-06', 950, None, 30)
(7902, 'FORD', 'ANALYST', 7566.0, '3-Dec-06', 3000, None, 20)
(7934, 'MILLER', 'CLERK', 7782.0, '23-Jan-07', 1300, None, 10)
(7369, 'SMITH', 'CLERK', 7902.0, '17-Dec-05', 800, None, 20)
(7499, 'ALLEN', 'SALESMAN', 7698.0, '20-Feb-06', 1600, 300.0, 30)
(7521, 'WARD', 'SALESMAN', 7698.0, '22-Feb-06', 1250, 500.0, 30)
(7566, 'JONES', 'MANAGER', 7839.0, '2-Apr-06', 2975, None, 20)
(7654, 'MARTIN', 'SALESMAN', 7698.0, '28-Sep-06', 1250, 1400.0, 30)
(7698, 'BLAKE', 'MANAGER', 7839.0, '1-May-06', 2850, None, 30)
(7782, 'CLARK', 'MANAGER', 7839.0, '9-Jun-06', 2450, None, 10)
(7788, 'SCOTT', 'ANALYST', 7566.0, '9-Dec-07', 3000, None, 20)
(7839, 'KING', 'PRESIDENT', None, '17-Nov-06', 5000, None, 10)
(7844, 'TURNER', 'SALESMAN', 7698.0, '8-Sep-06', 1500, 0.0, 30)
(7876, 'ADAMS', 'CLERK', 7788.0, '12-Jan-08', 1100, None, 20)
(7900, 'JAMES', 'CLERK', 7698.0, '3-Dec-06', 950, None, 30)
(7902, 'FORD', 'ANALYST', 7566.0, '3-Dec-06', 3000, None, 20)
(7934, 'MILLER', 'CLERK', 7782.0, '23-Jan-07', 1300, None, 10)
(7369, 'SMITH', 'CLERK', 7902.0, '17-Dec-05', 800, None, 20)
(7499, 'ALLEN', 'SALESMAN', 7698.0, '20-Feb-06', 1600, 300.0, 30)
(7521, 'WARD', 'SALESMAN', 7698.0, '22-Feb-06', 1250, 500.0, 30)
(7566, 'JONES', 'MANAGER', 7839.0, '2-Apr-06', 2975, None, 20)
(7654, 'MARTIN', 'SALESMAN', 7698.0, '28-Sep-06', 1250, 1400.0, 30)
(7698, 'BLAKE', 'MANAGER', 7839.0, '1-May-06', 2850, None, 30)
(7782, 'CLARK', 'MANAGER', 7839.0, '9-Jun-06', 2450, None, 10)
(7788, 'SCOTT', 'ANALYST', 7566.0, '9-Dec-07', 3000, None, 20)
(7839, 'KING', 'PRESIDENT', None, '17-Nov-06', 5000, None, 10)
(7844, 'TURNER', 'SALESMAN', 7698.0, '8-Sep-06', 1500, 0.0, 30)
(7876, 'ADAMS', 'CLERK', 7788.0, '12-Jan-08', 1100, None, 20)
(7900, 'JAMES', 'CLERK', 7698.0, '3-Dec-06', 950, None, 30)
(7902, 'FORD', 'ANALYST', 7566.0, '3-Dec-06', 3000, None, 20)
(7934, 'MILLER', 'CLERK', 7782.0, '23-Jan-07', 1300, None, 10)

In [13]:
for row in c.execute('''select * from emp where deptno=10'''):
    print(row)

(7782, 'CLARK', 'MANAGER', 7839.0, '9-Jun-06', 2450, None, 10)
(7839, 'KING', 'PRESIDENT', None, '17-Nov-06', 5000, None, 10)
(7934, 'MILLER', 'CLERK', 7782.0, '23-Jan-07', 1300, None, 10)
(7782, 'CLARK', 'MANAGER', 7839.0, '9-Jun-06', 2450, None, 10)
(7839, 'KING', 'PRESIDENT', None, '17-Nov-06', 5000, None, 10)
(7934, 'MILLER', 'CLERK', 7782.0, '23-Jan-07', 1300, None, 10)
(7782, 'CLARK', 'MANAGER', 7839.0, '9-Jun-06', 2450, None, 10)
(7839, 'KING', 'PRESIDENT', None, '17-Nov-06', 5000, None, 10)
(7934, 'MILLER', 'CLERK', 7782.0, '23-Jan-07', 1300, None, 10)
(7782, 'CLARK', 'MANAGER', 7839.0, '9-Jun-06', 2450, None, 10)
(7839, 'KING', 'PRESIDENT', None, '17-Nov-06', 5000, None, 10)
(7934, 'MILLER', 'CLERK', 7782.0, '23-Jan-07', 1300, None, 10)
(7782, 'CLARK', 'MANAGER', 7839.0, '9-Jun-06', 2450, None, 10)
(7839, 'KING', 'PRESIDENT', None, '17-Nov-06', 5000, None, 10)
(7934, 'MILLER', 'CLERK', 7782.0, '23-Jan-07', 1300, None, 10)

In [14]:
for row in c.execute('''select * from emp where (deptno=10 
or comm is not null
or sal <= 2000) and deptno=20'''):
    print(row)

(7369, 'SMITH', 'CLERK', 7902.0, '17-Dec-05', 800, None, 20)
(7876, 'ADAMS', 'CLERK', 7788.0, '12-Jan-08', 1100, None, 20)
(7369, 'SMITH', 'CLERK', 7902.0, '17-Dec-05', 800, None, 20)
(7876, 'ADAMS', 'CLERK', 7788.0, '12-Jan-08', 1100, None, 20)
(7369, 'SMITH', 'CLERK', 7902.0, '17-Dec-05', 800, None, 20)
(7876, 'ADAMS', 'CLERK', 7788.0, '12-Jan-08', 1100, None, 20)
(7369, 'SMITH', 'CLERK', 7902.0, '17-Dec-05', 800, None, 20)
(7876, 'ADAMS', 'CLERK', 7788.0, '12-Jan-08', 1100, None, 20)
(7369, 'SMITH', 'CLERK', 7902.0, '17-Dec-05', 800, None, 20)
(7876, 'ADAMS', 'CLERK', 7788.0, '12-Jan-08', 1100, None, 20)

##### Return specific colulmns

In [15]:
for row in c.execute('''SELECT ename, deptno, sal from emp'''):
    print(row)

('SMITH', 20, 800)
('ALLEN', 30, 1600)
('WARD', 30, 1250)
('JONES', 20, 2975)
('MARTIN', 30, 1250)
('BLAKE', 30, 2850)
('CLARK', 10, 2450)
('SCOTT', 20, 3000)
('KING', 10, 5000)
('TURNER', 30, 1500)
('ADAMS', 20, 1100)
('JAMES', 30, 950)
('FORD', 20, 3000)
('MILLER', 10, 1300)
('SMITH', 20, 800)
('ALLEN', 30, 1600)
('WARD', 30, 1250)
('JONES', 20, 2975)
('MARTIN', 30, 1250)
('BLAKE', 30, 2850)
('CLARK', 10, 2450)
('SCOTT', 20, 3000)
('KING', 10, 5000)
('TURNER', 30, 1500)
('ADAMS', 20, 1100)
('JAMES', 30, 950)
('FORD', 20, 3000)
('MILLER', 10, 1300)
('SMITH', 20, 800)
('ALLEN', 30, 1600)
('WARD', 30, 1250)
('JONES', 20, 2975)
('MARTIN', 30, 1250)
('BLAKE', 30, 2850)
('CLARK', 10, 2450)
('SCOTT', 20, 3000)
('KING', 10, 5000)
('TURNER', 30, 1500)
('ADAMS', 20, 1100)
('JAMES', 30, 950)
('FORD', 20, 3000)
('MILLER', 10, 1300)
('SMITH', 20, 800)
('ALLEN', 30, 1600)
('WARD', 30, 1250)
('JONES', 20, 2975)
('MARTIN', 30, 1250)
('BLAKE', 30, 2850)
('CLARK', 10, 2450)
('SCOTT', 20, 3000)
('KING', 10, 5000)
('TURNER', 30, 1500)
('ADAMS', 20, 1100)
('JAMES', 30, 950)
('FORD', 20, 3000)
('MILLER', 10, 1300)
('SMITH', 20, 800)
('ALLEN', 30, 1600)
('WARD', 30, 1250)
('JONES', 20, 2975)
('MARTIN', 30, 1250)
('BLAKE', 30, 2850)
('CLARK', 10, 2450)
('SCOTT', 20, 3000)
('KING', 10, 5000)
('TURNER', 30, 1500)
('ADAMS', 20, 1100)
('JAMES', 30, 950)
('FORD', 20, 3000)
('MILLER', 10, 1300)

##### To change the names of the columns using AS keyword. This is known as aliasing.

In [16]:
c.execute('''SELECT sal AS salary, comm AS commission FROM emp''')
#     column_name = c.description
#     for cname in column_name:
#         print(cname)
df = pd.DataFrame(c.fetchall(), columns=['SALARY', 'COMMISSION'])    
print(df)

    SALARY  COMMISSION
0      800         NaN
1     1600       300.0
2     1250       500.0
3     2975         NaN
4     1250      1400.0
..     ...         ...
65    1500         0.0
66    1100         NaN
67     950         NaN
68    3000         NaN
69    1300         NaN

[70 rows x 2 columns]

##### Problems with referencing the aliased columns in WHERE clause, the WHERE clause gets executed before the SELECT;Thus, the new aliases do not yet exist when the query's WHERE clause is evaluated. The solution is to wrap your query as an inline view. Use fetchall() to collect data

In [17]:
c.execute('''SELECT * from(SELECT sal AS salary, comm AS commision FROM emp) WHERE salary < 5000''')
df = pd.DataFrame(c.fetchall(), columns=['SALARY', 'COMMISSION'])
print(df)

    SALARY  COMMISSION
0      800         NaN
1     1600       300.0
2     1250       500.0
3     2975         NaN
4     1250      1400.0
..     ...         ...
60    1500         0.0
61    1100         NaN
62     950         NaN
63    3000         NaN
64    1300         NaN

[65 rows x 2 columns]

##### Concatenating the coulmn values. The usage is dependent on the DBs. For the DB2, Oracle, PostgreSQl, uses the vertical bars.

In [18]:
c.execute('''SELECT ename||' WORKS AS A '||job AS msg FROM emp WHERE deptno=10''')
df = pd.DataFrame(c.fetchall())
print(df)

                            0
0    CLARK WORKS AS A MANAGER
1   KING WORKS AS A PRESIDENT
2     MILLER WORKS AS A CLERK
3    CLARK WORKS AS A MANAGER
4   KING WORKS AS A PRESIDENT
5     MILLER WORKS AS A CLERK
6    CLARK WORKS AS A MANAGER
7   KING WORKS AS A PRESIDENT
8     MILLER WORKS AS A CLERK
9    CLARK WORKS AS A MANAGER
10  KING WORKS AS A PRESIDENT
11    MILLER WORKS AS A CLERK
12   CLARK WORKS AS A MANAGER
13  KING WORKS AS A PRESIDENT
14    MILLER WORKS AS A CLERK

- MySQL supports a function called CONCAT (sqlite doesn't support CONCAT())
  - c.execute('''SELECT concat(ename, 'WORKS AS A ',job) AS msg FROM emp WHERE deptno=10''') df = pd.DataFrame(c.fetchall()) print(df)
- SQL server, Uses the + operator for concatenation.
  - c.execute('''SELECT ename + ' WORKS AS A ' + job AS msg FROM emp WHERE deptno=10''') df = pd.DataFrame(c.fetchall()) print(df)

##### Using conditional logic in a SELECT statement. Use CASE expression to perform conditional logic directly in your SELECT statement

In [19]:
c.execute('''SELECT ename,sal, CASE when sal <= 2000 then 'UNDERPAID' when sal >= 4000 then 'overpaid' else 'OK' end as status from emp''')
df = pd.DataFrame(c.fetchall(), columns=['ename', 'salary', 'status'])
print(df)

     ename  salary     status
0    SMITH     800  UNDERPAID
1    ALLEN    1600  UNDERPAID
2     WARD    1250  UNDERPAID
3    JONES    2975         OK
4   MARTIN    1250  UNDERPAID
..     ...     ...        ...
65  TURNER    1500  UNDERPAID
66   ADAMS    1100  UNDERPAID
67   JAMES     950  UNDERPAID
68    FORD    3000         OK
69  MILLER    1300  UNDERPAID

[70 rows x 3 columns]

- The CASE expression allows to perform condition logic on values returned by a query. Also, you can alias the result of the CASE expression. In the above example CASE is aliased as status

##### Limit the number of rows returned.
- Using DB2
  - c.execute('''SELECT * FROM emp fetch 5 rows only''')

In [20]:
c.execute('''SELECT * FROM emp limit 5''')
df = pd.DataFrame(c.fetchall())
print(df)

      0       1         2       3          4     5       6   7
0  7369   SMITH     CLERK  7902.0  17-Dec-05   800     NaN  20
1  7499   ALLEN  SALESMAN  7698.0  20-Feb-06  1600   300.0  30
2  7521    WARD  SALESMAN  7698.0  22-Feb-06  1250   500.0  30
3  7566   JONES   MANAGER  7839.0   2-Apr-06  2975     NaN  20
4  7654  MARTIN  SALESMAN  7698.0  28-Sep-06  1250  1400.0  30

##### Returning a random record from a table. Use built-in RANDOM function in conjuction with LIMT and ORDER BY

In [21]:
c.execute('''SELECT ename,job FROM emp ORDER BY RANDOM() LIMIT 5''')
df = pd.DataFrame(c.fetchall(), columns=['ename','job'])
print(df)

   ename      job
0  JAMES    CLERK
1  CLARK  MANAGER
2   FORD  ANALYST
3  SCOTT  ANALYST
4  JAMES    CLERK

##### Finding Null Values. Determine whether the value is null, using IS NULL.

In [22]:
c.execute('''SELECT * FROM emp WHERE comm IS NULL''')
df = pd.DataFrame(c.fetchall())
print(df)

       0       1          2       3          4     5     6   7
0   7369   SMITH      CLERK  7902.0  17-Dec-05   800  None  20
1   7566   JONES    MANAGER  7839.0   2-Apr-06  2975  None  20
2   7698   BLAKE    MANAGER  7839.0   1-May-06  2850  None  30
3   7782   CLARK    MANAGER  7839.0   9-Jun-06  2450  None  10
4   7788   SCOTT    ANALYST  7566.0   9-Dec-07  3000  None  20
5   7839    KING  PRESIDENT     NaN  17-Nov-06  5000  None  10
6   7876   ADAMS      CLERK  7788.0  12-Jan-08  1100  None  20
7   7900   JAMES      CLERK  7698.0   3-Dec-06   950  None  30
8   7902    FORD    ANALYST  7566.0   3-Dec-06  3000  None  20
9   7934  MILLER      CLERK  7782.0  23-Jan-07  1300  None  10
10  7369   SMITH      CLERK  7902.0  17-Dec-05   800  None  20
11  7566   JONES    MANAGER  7839.0   2-Apr-06  2975  None  20
12  7698   BLAKE    MANAGER  7839.0   1-May-06  2850  None  30
13  7782   CLARK    MANAGER  7839.0   9-Jun-06  2450  None  10
14  7788   SCOTT    ANALYST  7566.0   9-Dec-07  3000  None  20
15  7839    KING  PRESIDENT     NaN  17-Nov-06  5000  None  10
16  7876   ADAMS      CLERK  7788.0  12-Jan-08  1100  None  20
17  7900   JAMES      CLERK  7698.0   3-Dec-06   950  None  30
18  7902    FORD    ANALYST  7566.0   3-Dec-06  3000  None  20
19  7934  MILLER      CLERK  7782.0  23-Jan-07  1300  None  10
20  7369   SMITH      CLERK  7902.0  17-Dec-05   800  None  20
21  7566   JONES    MANAGER  7839.0   2-Apr-06  2975  None  20
22  7698   BLAKE    MANAGER  7839.0   1-May-06  2850  None  30
23  7782   CLARK    MANAGER  7839.0   9-Jun-06  2450  None  10
24  7788   SCOTT    ANALYST  7566.0   9-Dec-07  3000  None  20
25  7839    KING  PRESIDENT     NaN  17-Nov-06  5000  None  10
26  7876   ADAMS      CLERK  7788.0  12-Jan-08  1100  None  20
27  7900   JAMES      CLERK  7698.0   3-Dec-06   950  None  30
28  7902    FORD    ANALYST  7566.0   3-Dec-06  3000  None  20
29  7934  MILLER      CLERK  7782.0  23-Jan-07  1300  None  10
30  7369   SMITH      CLERK  7902.0  17-Dec-05   800  None  20
31  7566   JONES    MANAGER  7839.0   2-Apr-06  2975  None  20
32  7698   BLAKE    MANAGER  7839.0   1-May-06  2850  None  30
33  7782   CLARK    MANAGER  7839.0   9-Jun-06  2450  None  10
34  7788   SCOTT    ANALYST  7566.0   9-Dec-07  3000  None  20
35  7839    KING  PRESIDENT     NaN  17-Nov-06  5000  None  10
36  7876   ADAMS      CLERK  7788.0  12-Jan-08  1100  None  20
37  7900   JAMES      CLERK  7698.0   3-Dec-06   950  None  30
38  7902    FORD    ANALYST  7566.0   3-Dec-06  3000  None  20
39  7934  MILLER      CLERK  7782.0  23-Jan-07  1300  None  10
40  7369   SMITH      CLERK  7902.0  17-Dec-05   800  None  20
41  7566   JONES    MANAGER  7839.0   2-Apr-06  2975  None  20
42  7698   BLAKE    MANAGER  7839.0   1-May-06  2850  None  30
43  7782   CLARK    MANAGER  7839.0   9-Jun-06  2450  None  10
44  7788   SCOTT    ANALYST  7566.0   9-Dec-07  3000  None  20
45  7839    KING  PRESIDENT     NaN  17-Nov-06  5000  None  10
46  7876   ADAMS      CLERK  7788.0  12-Jan-08  1100  None  20
47  7900   JAMES      CLERK  7698.0   3-Dec-06   950  None  30
48  7902    FORD    ANALYST  7566.0   3-Dec-06  3000  None  20
49  7934  MILLER      CLERK  7782.0  23-Jan-07  1300  None  10

- Transforming Null into real values, Use the function COALESCE to sunstitute real values for nulls

In [23]:
c.execute('''SELECT COALESCE(comm,0) FROM emp''')
df = pd.DataFrame(c.fetchall())
print(df)

         0
0      0.0
1    300.0
2    500.0
3      0.0
4   1400.0
..     ...
65     0.0
66     0.0
67     0.0
68     0.0
69     0.0

[70 rows x 1 columns]

- You can also use the CASE to values

In [24]:
c.execute('''SELECT CASE
                    WHEN comm IS NOT NULL THEN comm
                    ELSE 0
                    END
            FROM emp''')
df = pd.DataFrame(c.fetchall())
print(df)

         0
0      0.0
1    300.0
2    500.0
3      0.0
4   1400.0
..     ...
65     0.0
66     0.0
67     0.0
68     0.0
69     0.0

[70 rows x 1 columns]

##### Seraching for a pattern, use the LIKE operator in conjunction with the SQL wildcard operator (%)

In [25]:
c.execute('''SELECT ename, job FROM emp WHERE deptno in (10, 20) AND (ename LIKE '%I%' OR job LIKE '%ER')''')
df = pd.DataFrame(c.fetchall(), columns=['ename', 'job'])
print(df)

     ename        job
0    SMITH      CLERK
1    JONES    MANAGER
2    CLARK    MANAGER
3     KING  PRESIDENT
4   MILLER      CLERK
5    SMITH      CLERK
6    JONES    MANAGER
7    CLARK    MANAGER
8     KING  PRESIDENT
9   MILLER      CLERK
10   SMITH      CLERK
11   JONES    MANAGER
12   CLARK    MANAGER
13    KING  PRESIDENT
14  MILLER      CLERK
15   SMITH      CLERK
16   JONES    MANAGER
17   CLARK    MANAGER
18    KING  PRESIDENT
19  MILLER      CLERK
20   SMITH      CLERK
21   JONES    MANAGER
22   CLARK    MANAGER
23    KING  PRESIDENT
24  MILLER      CLERK

#### Convert Jupyter to PDF

In [26]:
!wget -nc https://raw.githubusercontent.com/brpy/colab-pdf/master/colab_pdf.py
from colab_pdf import colab_pdf
colab_pdf('week1-sqlite.ipynb')

/bin/bash: wget: command not found

ModuleNotFoundError: No module named 'colab_pdf'